//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// /*++
// Copyright (c) 2015 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#

#langdef   en-US "English"

#string STR_USB_CONFIGURATION               #language en-US "USB Configuration"
#string STR_USB_CONFIGURATION_HELP          #language en-US "USB Configuration Parameters"
#string STR_USB_IO_PM_SUPPORT               #language en-US "USB IO PM"
#string STR_USB_IO_PM_SUPPORT_HELP          #language en-US "Enable/Disable IO PM"
#string STR_USB_ENABLED                     #language en-US "Enabled"
#string STR_USB_DISABLED                    #language en-US "Disabled"
#string STR_USB_AUTO                        #language en-US "Auto"
#string STR_USB_MODULE_VERSION_VALUE        #language en-US "N/A"
#string STR_USB_DEVICES_ENABLED             #language en-US "USB Devices:"
#string STR_USB_DEVICES_ENABLED_LIST        #language en-US "N/A" //dynamically updated
#string STR_USB_SUPPORT                     #language en-US "USB Support"
#string STR_USB_SUPPORT_HELP                #language en-US "USB Support Parameters"
#string STR_USB_LEGACY_SUPPORT              #language en-US "Legacy USB Support"
#string STR_USB_LEGACY_SUPPORT_HELP         #language en-US "Enables Legacy USB support. AUTO option disables legacy support if no USB devices are connected. DISABLE option will keep USB devices available only for EFI applications."
#string STR_USB_XHCI_SUPPORT                #language en-US "USB3.0 Support"
#string STR_USB_XHCI_SUPPORT_HELP           #language en-US "Enable/Disable USB3.0 (XHCI) Controller support."
#string STR_USB_MASS_DEVICE1                #language en-US "N/A"
#string STR_USB_MASS_DEVICE2                #language en-US "N/A"
#string STR_USB_MASS_DEVICE3                #language en-US "N/A"
#string STR_USB_MASS_DEVICE4                #language en-US "N/A"
#string STR_USB_MASS_DEVICE5                #language en-US "N/A"
#string STR_USB_MASS_DEVICE6                #language en-US "N/A"
#string STR_USB_MASS_DEVICE7                #language en-US "N/A"
#string STR_USB_MASS_DEVICE8                #language en-US "N/A"
#string STR_PCH_USB30_MODE_PROMPT           #language en-US "XHCI Mode"
#string STR_PCH_USB30_MODE_HELP             #language en-US "Disabled - Hide XHCI.  Enabled - Always use XHCI.  Auto - Always start with EHCI in BIOS and when OS driver loaded switch to XHCI.  Smart Auto - First boot start with EHCI in BIOS and when OS driver loaded switch to XHCI, continue using XHCI in BIOS during reboot.  Manual - Use by validation, not for end-user."
#string STR_USB_PRECONDITION_SUPPORT        #language en-US "USB Precondition"
#string STR_USB_PRECONDITION_SUPPORT_HELP   #language en-US "Precondition work on USB host controller and root ports for faster enumeration."
#string STR_USB_BTCG_SUPPORT                #language en-US "Trunk Clock Gating (BTCG)"
#string STR_USB_BTCG_SUPPORT_HELP           #language en-US "Enable/Disable BTCG"
#string STR_PCH_ENABLE_USB3_PIN_PROMPT      #language en-US "Enable USB 3.0 pins"
#string STR_PCH_SELECT_PER_PIN_PROMPT       #language en-US "Select Per-Pin"
#string STR_DISABLE_ALL_PIN_STRING          #language en-US "Disable all pins"
#string STR_ENABLE_ALL_PIN_STRING           #language en-US "Enable all pins"
#string STR_PCH_USB3_PIN1_PROMPT            #language en-US "USB 3.0 pin #1"
#string STR_PCH_USB3_PIN2_PROMPT            #language en-US "USB 3.0 pin #2"
#string STR_PCH_USB3_PIN3_PROMPT            #language en-US "USB 3.0 pin #3"
#string STR_PCH_USB3_PIN4_PROMPT            #language en-US "USB 3.0 pin #4"
#string STR_PCH_USB3_PIN5_PROMPT            #language en-US "USB 3.0 pin #5"
#string STR_PCH_USB3_PIN6_PROMPT            #language en-US "USB 3.0 pin #6"
#string STR_PCH_USB_PER_PORT_PROMPT             #language en-US  "USB Ports Per-Port Disable Control"
#string STR_PCH_USB_PER_PORT_HELP               #language en-US  "Control each of the USB ports (0~13) disabling."
#string STR_PCH_USB_PORT0_PROMPT                #language en-US  "USB Port #0 Disable"
#string STR_PCH_USB_PORT1_PROMPT                #language en-US  "USB Port #1 Disable"
#string STR_PCH_USB_PORT2_PROMPT                #language en-US  "USB Port #2 Disable"
#string STR_PCH_USB_PORT3_PROMPT                #language en-US  "USB Port #3 Disable"
#string STR_PCH_USB_PORT4_PROMPT                #language en-US  "USB Port #4 Disable"
#string STR_PCH_USB_PORT5_PROMPT                #language en-US  "USB Port #5 Disable"
#string STR_PCH_USB_PORT6_PROMPT                #language en-US  "USB Port #6 Disable"
#string STR_PCH_USB_PORT7_PROMPT                #language en-US  "USB Port #7 Disable"
#string STR_PCH_USB_PORT_DIS_HELP           #language en-US "USB Port Disable"
#string STR_DISABLED_USB2_USB3              #language en-US "Disable USB2 and USB3"
#string STR_DISABLED_USB2                   #language en-US "Disable USB2"
#string STR_DISABLED_USB3                   #language en-US "Disable USB3"

#string STR_XHCI_INACTIVITY_L1E_PROMPT      #language en-US "Inactivity Initiated L1"
#string STR_XHCI_INACTIVITY_L1E_HELP        #language en-US "If programmed to non-zero, it allows L1 power managed to be enabled after the time-out period specified"
#string STR_32_BB_CCLK                      #language en-US "32 bb_cclk"
#string STR_64_BB_CCLK                      #language en-US "64 bb_cclk"
#string STR_128_BB_CCLK                     #language en-US "128 bb_cclk"
#string STR_256_BB_CCLK                     #language en-US "256 bb_cclk"
#string STR_512_BB_CCLK                     #language en-US "512 bb_cclk"
#string STR_1024_BB_CCLK                    #language en-US "1024 bb_cclk"
#string STR_131072_BB_CCLK                  #language en-US "131072 bb_cclk"
#string STR_XHC_L1E_PROMPT                  #language en-US "XHC Initiated L1"
#string STR_XHC_L1E_HELP                    #language en-US "If set, allow the XHC initiated L1 power mangement to be enabled."
